apemangr/Repetidor-nRF52-SDK-17.1.0/app_nus_server.c
                case 8: // Comando 08: Escribe en la memoria flash la fecha, hora, formato YYYYMMDDHHMMSS
                {
                    NRF_LOG_RAW_INFO("\n\n\x1b[1;36m--- Comando 08 recibido: Guardar "
                                     "fecha y hora\x1b[0m");

                    if (p_evt->params.rx_data.length >=
                        19) // 5 de comando + 14 de fecha/hora
                    {
                        const char *fecha_iso =
                            &message[5]; // Apunta al inicio de la fecha/hora

                        datetime_t dt;
                        if (sscanf(fecha_iso, "%4hu%2hhu%2hhu%2hhu%2hhu%2hhu", &dt.year,
                                   &dt.month, &dt.day, &dt.hour, &dt.minute,
                                   &dt.second) == 6)
                        {
                            NRF_LOG_RAW_INFO("\nFecha recibida: "
                                             "%04u-%02u-%02u %02u:%02u:%02u",
                                             dt.year, dt.month, dt.day, dt.hour, dt.minute,
                                             dt.second);

                            // Llamar a la función modificada
                            err_code = write_date_to_flash(&dt);

                            if (err_code != NRF_SUCCESS)
                            {
                                NRF_LOG_ERROR("Error guardando: 0x%X", err_code);
                            }
                        }
                        else
                        {
                            NRF_LOG_WARNING("Formato inválido. Se esperaba "
                                            "YYYYMMDDHHMMSS.");
                        }
                    }
                    else
                    {
                        NRF_LOG_WARNING("Datos insuficientes. Se esperaban 14 dígitos");
                    }
                    break;
                }
                case 9: // Comando 09: Leer fecha y hora almacenada en flash
                {
                    NRF_LOG_RAW_INFO("\n\n\x1b[1;36m--- Comando 09 recibido: Leer fecha "
                                     "y hora\x1b[0m");

                    // Leer fecha de la memoria flash
                    datetime_t dt = read_date_from_flash();

                    // Mostrar fecha leída
                    NRF_LOG_RAW_INFO(
                        "\n>> Fecha almacenada: %04u-%02u-%02u %02u:%02u:%02u", dt.year,
                        dt.month, dt.day, dt.hour, dt.minute, dt.second);

                    break;
                }
                case 10: // Comando para solicitar el último historial al periférico
                {
                    // NRF_LOG_RAW_INFO("\n\n\x1b[1;36m--- Comando 10 recibido: Solicitar último historial al periférico\x1b[0m");

                    // // Comando a enviar al periférico
                    // uint8_t  command_to_peripheral = 0x08; // Comando 08 para solicitar el último historial
                    // uint16_t command_length        = 1;

                    // // Enviar el comando al periférico a través del cliente NUS
                    // ret_code_t err_code = app_nus_client_send_command(&command_to_peripheral, command_length);
                    // if (err_code == NRF_SUCCESS)
                    // {
                    //     NRF_LOG_RAW_INFO("\nComando 08 enviado al periférico para solicitar el último historial.\n");
                    // }
                    // else
                    // {
                    //     NRF_LOG_RAW_INFO("\nError al enviar el comando 08 al periférico: 0x%X\n", err_code);
                    // }
                    // break;
                }
                case 11: // Solicitar un registro de historial por ID
                {
                    NRF_LOG_RAW_INFO("\n\n\x1b[1;36m--- Comando 11 recibido: Solicitar registro de historial por ID\x1b[0m");
                    if (p_evt->params.rx_data.length > 5) // Verifica que haya datos suficientes
                    {
                        // Extrae el ID del registro como string (todo lo que sigue después de "11111")
                        size_t id_len    = p_evt->params.rx_data.length - 5;
                        char   id_str[8] = {0}; // Soporta hasta 7 dígitos, ajusta si necesitas más
                        if (id_len < sizeof(id_str))
                        {
                            memcpy(id_str, &message[5], id_len);
                            id_str[id_len]       = '\0';
                            uint16_t registro_id = (uint16_t)atoi(id_str);
                            // Llama a la función para solicitar el registro por ID
                            store_history registro_historial;
                            err_code = read_history_record_by_id(registro_id, &registro_historial);
                            if (err_code == NRF_SUCCESS)
                            {
                                NRF_LOG_RAW_INFO("\nSolicitud de registro %u enviada correctamente.", registro_id);
                                // Imprime el registro de historial
                                char titulo[41];
                                snprintf(titulo, sizeof(titulo), "Historial recibido \x1B[33m#%u\x1B[0m", registro_id);
                                print_history_record(&registro_historial, titulo);
                                NRF_LOG_FLUSH();
                            }
                            else
                            {
                                NRF_LOG_RAW_INFO("\nError al solicitar el registro %u: 0x%X", registro_id, err_code);
                            }
                        }
                        else
                        {
                            NRF_LOG_WARNING("ID de registro demasiado largo.");
                        }
                    }
                    break;
                }
                case 12: // Guardar un nuevo historial con valores inventados

                    NRF_LOG_RAW_INFO("\n\n\x1b[1;36m--- Comando 12 recibido: Guardar nuevo historial de prueba\x1b[0m");

                    store_history nuevo_historial;
                    nuevo_historial.year     = 2025;
                    nuevo_historial.month    = 6;
                    nuevo_historial.day      = 9;
                    nuevo_historial.hour     = 12;
                    nuevo_historial.minute   = 34;
                    nuevo_historial.second   = 56;
                    nuevo_historial.contador = 4321;
                    nuevo_historial.V1       = 111;
                    nuevo_historial.V2       = 222;
                    nuevo_historial.V3       = 333;
                    nuevo_historial.V4       = 444;
                    nuevo_historial.V5       = 555;
                    nuevo_historial.V6       = 666;
                    nuevo_historial.V7       = 777;
                    nuevo_historial.V8       = 888;
                    nuevo_historial.temp     = 27;
                    nuevo_historial.battery  = 99;

                    //
                    err_code = save_history_record(&nuevo_historial);

                    if (err_code == NRF_SUCCESS)
                    {
                        NRF_LOG_RAW_INFO("\nHistorial de prueba guardado correctamente.");
                        print_history_record(&nuevo_historial, "Historial de prueba guardado");
                    }
                    else
                    {
                        NRF_LOG_ERROR("Error al guardar historial de prueba: 0x%X", err_code);
                    }
                    break;

                case 13: // Mostrar e incrementar el record_id de history
                {
                    
