apemangr/Repetidor-nRF52-SDK-17.1.0/app_nus_server.c
                }
                default: // Comando desconocido
                    NRF_LOG_WARNING("Comando desconocido: %s", command);
                    break;
                }
            }
            else
            {
                // Reenvía el mensaje al emisor o lo maneja normalmente
                if (m_on_data_received)
                {
                    m_on_data_received((uint8_t *)message, p_evt->params.rx_data.length);
                }
            }
        }
        else
        {
            NRF_LOG_WARNING("Mensaje demasiado largo para procesar.");
        }
    }
}

static void gap_params_init(void)
{
    uint32_t                err_code;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    err_code = sd_ble_gap_device_name_set(&sec_mode, (const uint8_t *)DEVICE_NAME,
                                          strlen(DEVICE_NAME));
    APP_ERROR_CHECK(err_code);

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

    err_code                          = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for initializing services that will be used by the
 * application.
 */
static void services_init(void)
{
    uint32_t           err_code;
    ble_nus_init_t     nus_init;
    nrf_ble_qwr_init_t qwr_init = {0};

    // Initialize Queued Write Module.
    qwr_init.error_handler = nrf_qwr_error_handler;

    err_code               = nrf_ble_qwr_init(&m_qwr, &qwr_init);
    APP_ERROR_CHECK(err_code);

    // Initialize NUS.
    memset(&nus_init, 0, sizeof(nus_init));

    nus_init.data_handler = nus_data_handler;

    err_code              = ble_nus_init(&m_nus, &nus_init);
    APP_ERROR_CHECK(err_code);
}

static void on_conn_params_evt(ble_conn_params_evt_t *p_evt)
{
    uint32_t err_code;

    if (p_evt->evt_type == BLE_CONN_PARAMS_EVT_FAILED)
    {
        err_code = sd_ble_gap_disconnect(m_conn_handle,
                                         BLE_HCI_CONN_INTERVAL_UNACCEPTABLE);
        APP_ERROR_CHECK(err_code);
    }
}

static void conn_params_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}

static void conn_params_init(void)
{
    uint32_t               err_code;
    ble_conn_params_init_t cp_init;

    memset(&cp_init, 0, sizeof(cp_init));

    cp_init.p_conn_params                  = NULL;
    cp_init.first_conn_params_update_delay = FIRST_CONN_PARAMS_UPDATE_DELAY;
    cp_init.next_conn_params_update_delay  = NEXT_CONN_PARAMS_UPDATE_DELAY;
    cp_init.max_conn_params_update_count   = MAX_CONN_PARAMS_UPDATE_COUNT;
    cp_init.start_on_notify_cccd_handle    = BLE_GATT_HANDLE_INVALID;
    cp_init.disconnect_on_fail             = true;
    cp_init.evt_handler                    = on_conn_params_evt;
    cp_init.error_handler                  = conn_params_error_handler;
    err_code                               = ble_conn_params_init(&cp_init);
    APP_ERROR_CHECK(err_code);
}

static void on_adv_evt(ble_adv_evt_t ble_adv_evt)
{
    uint32_t err_code;

    switch (ble_adv_evt)
    {
    case BLE_ADV_EVT_FAST:
        err_code = bsp_indication_set(BSP_INDICATE_ADVERTISING);
        APP_ERROR_CHECK(err_code);
        break;
    case BLE_ADV_EVT_IDLE:
        // sleep_mode_enter();
        break;
    default:
        break;
    }
}

void app_nus_server_ble_evt_handler(ble_evt_t const *p_ble_evt)
{
    uint32_t             err_code;
    ble_gap_evt_t const *p_gap_evt = &p_ble_evt->evt.gap_evt;

    switch (p_ble_evt->header.evt_id)
    {

    case BLE_GAP_EVT_CONNECTED:
        if (p_gap_evt->params.connected.role == BLE_GAP_ROLE_PERIPH)
        {
            NRF_LOG_RAW_INFO("\nCelular conectado");
            m_conn_handle = p_ble_evt->evt.gap_evt.conn_handle;
            restart_on_rtc();
        }
        else if (p_gap_evt->params.connected.role == BLE_GAP_ROLE_CENTRAL)
        {
            NRF_LOG_RAW_INFO("\nEmisor conectado");
            m_emisor_conn_handle = p_ble_evt->evt.gap_evt.conn_handle;
        }
        break;

        // case BLE_GATTS_EVT_WRITE:
        // {
        //     ble_gatts_evt_write_t const * p_evt_write = &p_ble_evt->evt.gatts_evt.params.write;
        //     NRF_LOG_RAW_INFO("\nWRITE handle: 0x%04X, cccd_handle: 0x%04X, conn_handle: 0x%04X, emisor_conn_handle: 0x%04X",
        //         p_evt_write->handle, m_nus.tx_handles.cccd_handle,
        //         p_ble_evt->evt.gatts_evt.conn_handle, m_emisor_conn_handle);

        //     if (p_evt_write->handle == m_nus.tx_handles.cccd_handle &&
        //         p_ble_evt->evt.gatts_evt.conn_handle == m_emisor_conn_handle &&
        //         p_evt_write->data[0] == 0x01)
        //     {
        //         NRF_LOG_RAW_INFO("\nNotificaciones habilitadas por el emisor, enviando comando...");
        //         uint8_t comando_conexion[] = {0xAA};
        //         uint16_t len = sizeof(comando_conexion);
        //         err_code = ble_nus_data_send(&m_nus, comando_conexion, &len, m_emisor_conn_handle);
        //         if (err_code == NRF_SUCCESS)
        //         {
        //             NRF_LOG_RAW_INFO("\nComando enviado al emisor tras habilitar notificaciones.");
        //         }
        //         else
        //         {
        //             NRF_LOG_ERROR("Error al enviar comando al emisor: 0x%X", err_code);
        //         }
        //     }
        // }
        // break;

    case BLE_GAP_EVT_DISCONNECTED:
        if (p_gap_evt->conn_handle == m_conn_handle)
        {
            ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
            NRF_LOG_RAW_INFO("\nCelular desconectado\n");
            m_conn_handle = BLE_CONN_HANDLE_INVALID; // Invalida el handle del celular
        }
        else if (p_gap_evt->conn_handle == m_emisor_conn_handle)
        {
            NRF_LOG_RAW_INFO("\nEmisor desconectado");
            NRF_LOG_RAW_INFO("\n\nBuscando emisor...\n");

            m_emisor_conn_handle =
                BLE_CONN_HANDLE_INVALID; // Invalida el handle del emisor
            scan_start();
        }
        break;

    case BLE_GAP_EVT_PHY_UPDATE_REQUEST: {
        NRF_LOG_DEBUG("PHY update request.");
        ble_gap_phys_t const phys = {
            .rx_phys = BLE_GAP_PHY_AUTO,
            .tx_phys = BLE_GAP_PHY_AUTO,
        };
        err_code = sd_ble_gap_phy_update(p_ble_evt->evt.gap_evt.conn_handle, &phys);
        APP_ERROR_CHECK(err_code);
    }
    break;

    case BLE_GAP_EVT_SEC_PARAMS_REQUEST:
        // Pairing not supported
        err_code = sd_ble_gap_sec_params_reply(
            m_conn_handle, BLE_GAP_SEC_STATUS_PAIRING_NOT_SUPP, NULL, NULL);
        APP_ERROR_CHECK(err_code);
        break;

    case BLE_GATTS_EVT_SYS_ATTR_MISSING:
        // No system attributes have been stored.
        err_code = sd_ble_gatts_sys_attr_set(m_conn_handle, NULL, 0, 0);
        APP_ERROR_CHECK(err_code);
        break;

    case BLE_GATTC_EVT_TIMEOUT:
        // Disconnect on GATT Client timeout event.
        err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gattc_evt.conn_handle,
                                         BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
        APP_ERROR_CHECK(err_code);
        break;

    case BLE_GATTS_EVT_TIMEOUT:
        // Disconnect on GATT Server timeout event.
        err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gatts_evt.conn_handle,
                                         BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
        APP_ERROR_CHECK(err_code);
        break;

    default:
        // No implementation needed.
        break;
    }
}

uint32_t app_nus_server_send_data(const uint8_t *data_array, uint16_t length)
{
    return ble_nus_data_send(&m_nus, (uint8_t *)data_array, &length,
                             m_conn_handle);
}


/**@brief Function for initializing the Advertising functionality.
 */

//static void advertising_init(void)
void advertising_init(void)
{
    uint32_t                 err_code;
    ble_advertising_init_t   init;
    ble_advdata_manuf_data_t manuf_specific_data;

    memset(&m_beacon_info, 0, sizeof(m_beacon_info));

